server/__test__/stress/related.yml
config:
  target: "http://127.0.0.1:3500"
  phases:
    - duration: 60
      arrivalRate: 10
      name: VU - 10
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: VU - 50
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: VU - 100
    - duration: 30
      arrivalRate: 10
      rampTo: 150
      name: VU - 150
    - duration: 30
      arrivalRate: 10
      rampTo: 200
      name: VU - 200
  payload:
    path: "product.csv"
    fields:
      - "productId"
  plugins:
    metrics-by-endpoint:
      # Group metrics by request name rather than URL:
      useOnlyRequestNames: true

scenarios:
  - name: "GET/products"
    flow:
      - get:
          url: "/products/{{ productId }}/related"
          name: "GET/products"
      - think: 1